OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBH_VENDOR_LBK/lbk_driver.c
/**************************************************************************//**
 * @file     s_LbkDriver.c
 * @version  1.0.1
 * @brief    M2351 MCU USB Host Vendor LBK driver
 *
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <string.h>

#include "NuMicro.h"

#include "usb.h"
#include "usbh_lib.h"
#include "lbk_driver.h"


typedef struct lbk_device_t
{
    UDEV_T       *udev;
    IFACE_T      *iface;
    EP_INFO_T    *ep_bulk_in;
    EP_INFO_T    *ep_bulk_out;
    EP_INFO_T    *ep_int_in;
    EP_INFO_T    *ep_int_out;
    EP_INFO_T    *ep_iso_in;
    EP_INFO_T    *ep_iso_out;
    INT_CB_FUNC  *int_in_func;
    INT_CB_FUNC  *int_out_func;
    ISO_CB_FUNC  *iso_in_func;
    ISO_CB_FUNC  *iso_out_func;
    UTR_T        *utr_int_in[2];
    uint8_t      buff_int_in[2][512];
    UTR_T        *utr_int_out[2];
    uint8_t      buff_int_out[2][512];
    UTR_T        *utr_iso_in[ISO_UTR_NUM];
    UTR_T        *utr_iso_out[ISO_UTR_NUM];
}  LBK_DEV_T;

static volatile struct lbk_device_t  s_LbkDev;


/*
 *  Issue a vendor command REQ_SET_DATA to send data to Vendor LBK device.
 *  Use control-in transfer.
 */
int  lbk_vendor_set_data(uint8_t *buff)
{
    uint32_t   xfer_len = 0;
    int        ret;

    if(s_LbkDev.udev == NULL)
        return -1;

    ret = usbh_ctrl_xfer(s_LbkDev.udev,
                         REQ_TYPE_OUT | REQ_TYPE_CLASS_DEV | REQ_TYPE_TO_DEV,  /* bmRequestType  */
                         REQ_SET_DATA,                  /* bRequest                              */
                         0,                             /* wValue: not used in this command      */
                         0,                             /* wIndex: not used in this command      */
                         64,                            /* wLength: this command always send 64 bytes  */
                         buff,                          /* data buffer                           */
                         &xfer_len,                     /* actual length of data send            */
                         100);

    if((ret < 0) || (xfer_len != 64))
    {
        printf("REQ_SET_DATA command failed! %d, %d\n", ret, xfer_len);
        return ret;
    }
    return 0;
}

/*
 *  Issue a vendor command REQ_GET_DATA to get data from Vendor LBK device.
 *  Use control-out transfer.
 */
int  lbk_vendor_get_data(uint8_t *buff)
{
    uint32_t   xfer_len = 0;
    int        ret;

    if(s_LbkDev.udev == NULL)
        return -1;

    ret = usbh_ctrl_xfer(s_LbkDev.udev,
                         REQ_TYPE_IN | REQ_TYPE_CLASS_DEV | REQ_TYPE_TO_DEV,   /* bmRequestType  */
                         REQ_GET_DATA,                  /* bRequest                              */
                         0,                             /* wValue: not used in this command      */
                         0,                             /* wIndex: not used in this command      */
                         64,                            /* wLength: this command always get 64 bytes  */
                         buff,                          /* data buffer                           */
                         &xfer_len,                     /* actual length of data received        */
                         100);

    if((ret < 0) || (xfer_len != 64))
    {
        printf("REQ_GET_DATA command failed! %d, %d\n", ret, xfer_len);
        return ret;
    }
    return 0;
}

/*
 *  Write a block of data to Vendor LBK device.
 *  Use bulk-out transfer.
 */
int lbk_bulk_write(uint8_t *data_buff, uint32_t data_len, uint32_t timeout_ticks)
{
    UTR_T     *utr;
    uint32_t  t0;
    int       ret;

    if((s_LbkDev.udev == NULL) || (s_LbkDev.ep_bulk_out == NULL))
        return -1;

    utr = alloc_utr(s_LbkDev.udev);
    if(!utr)
        return USBH_ERR_MEMORY_OUT;

    utr->ep = s_LbkDev.ep_bulk_out;
    utr->buff = data_buff;
    utr->data_len = data_len;
    utr->xfer_len = 0;
    utr->func = NULL;
    utr->bIsTransferDone = 0;

    ret = usbh_bulk_xfer(utr);
    if(ret < 0)
    {
        free_utr(utr);
        return ret;
    }

    t0 = get_ticks();
    while(utr->bIsTransferDone == 0)
    {
        if(get_ticks() - t0 > timeout_ticks)
        {
            usbh_quit_utr(utr);
            free_utr(utr);
            return USBH_ERR_TIMEOUT;
        }
    }
    ret = utr->status;
    free_utr(utr);
    return ret;
}

/*
 *  Read a block of data from Vendor LBK device.
 *  Use bulk-in transfer.
 */
int lbk_bulk_read(uint8_t *data_buff, uint32_t data_len, uint32_t timeout_ticks)
{
    UTR_T     *utr;
    uint32_t  t0;
    int       ret;

    if((s_LbkDev.udev == NULL) || (s_LbkDev.ep_bulk_in == NULL))
        return -1;

    utr = alloc_utr(s_LbkDev.udev);
    if(!utr)
        return USBH_ERR_MEMORY_OUT;

    utr->ep = s_LbkDev.ep_bulk_in;
    utr->buff = data_buff;
    utr->data_len = data_len;
    utr->xfer_len = 0;
    utr->func = NULL;
    utr->bIsTransferDone = 0;

    ret = usbh_bulk_xfer(utr);
    if(ret < 0)
    {
        free_utr(utr);
        return ret;
    }

    t0 = get_ticks();
    while(utr->bIsTransferDone == 0)
    {
        if(get_ticks() - t0 > timeout_ticks)
        {
            usbh_quit_utr(utr);
            free_utr(utr);
            return USBH_ERR_TIMEOUT;
        }
    }
    ret = utr->status;
    free_utr(utr);
    return ret;
}

static void  int_in_done(UTR_T *utr)
{
    int         ret;

    //printf("int_in_done. %d\n", utr->xfer_len);
    if(s_LbkDev.int_in_func == NULL)
        goto err_out;           /* interrupt-in stopped */

    if(utr->status != 0)
    {
        s_LbkDev.int_in_func(utr->status, utr->buff, (int)utr->xfer_len);
        printf("int_in_done - stop or error: 0x%x\n", utr->status);
        goto err_out;
    }

    if(s_LbkDev.int_in_func && utr->xfer_len)
        s_LbkDev.int_in_func(utr->status, utr->buff, (int)utr->xfer_len);

    utr->xfer_len = 0;
    ret = usbh_int_xfer(utr);
    if(ret != 0)
    {
        printf("int_in_done - failed to re-submit interrupt-in request (%d)", ret);
        s_LbkDev.int_in_func(ret, utr->buff, 0);
        goto err_out;
    }
    return;

err_out:
    if(utr == s_LbkDev.utr_int_in[0])
    {
        free_utr(s_LbkDev.utr_int_in[0]);
        s_LbkDev.utr_int_in[0] = NULL;
    }
    else if(utr == s_LbkDev.utr_int_in[1])
    {
        free_utr(s_LbkDev.utr_int_in[1]);
        s_LbkDev.utr_int_in[1] = NULL;
    }
}

