OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBH_VENDOR_LBK/lbk_driver.c
/*
 *  Start interrupt-in transfer on Vendor LBK device.
 */
int lbk_interrupt_in_start(INT_CB_FUNC *func)
{
    UTR_T     *utr;
    int       i, ret;

    if((s_LbkDev.udev == NULL) || (s_LbkDev.ep_int_in == NULL) || (func == NULL))
        return -1;

    for(i = 0; i < 2; i++)
    {
        utr = alloc_utr(s_LbkDev.udev);
        if(!utr)
            return USBH_ERR_MEMORY_OUT;

        utr->ep = s_LbkDev.ep_int_in;
        utr->buff = (uint8_t *)(uint32_t)s_LbkDev.buff_int_in[i];
        utr->data_len = utr->ep->wMaxPacketSize;
        utr->xfer_len = 0;
        utr->func = int_in_done;
        s_LbkDev.int_in_func = func;
        s_LbkDev.utr_int_in[i] = utr;

        ret = usbh_int_xfer(utr);
        if(ret < 0)
        {
            //printf("Error - failed to submit interrupt-in transfer (%d)\n", ret);
            free_utr(utr);
            s_LbkDev.utr_int_in[i] = NULL;
            return ret;
        }
    }
    return 0;
}

void lbk_interrupt_in_stop(void)
{
    int   i;

    /* clear <int_in_func> to stop cascading transfers */
    s_LbkDev.int_in_func = NULL;
    delay_us(32000);

    for(i = 0; i < 2; i++)
    {
        if(s_LbkDev.utr_int_in[i] != NULL)
        {
            usbh_quit_utr(s_LbkDev.utr_int_in[i]);    /* force to stop the transfer   */
            delay_us(32000);
            free_utr(s_LbkDev.utr_int_in[i]);
            s_LbkDev.utr_int_in[i] = NULL;
        }
    }
}

static void  int_out_done(UTR_T *utr)
{
    int         ret;

    //printf("int_out_done. %d\n", utr->xfer_len);
    if(s_LbkDev.int_out_func == NULL)
        goto err_out;              /* interrupt-out stopped */

    if(utr->status != 0)
    {
        printf("int_out_done - stop or error: 0x%x\n", utr->status);
        utr->data_len = (uint32_t)s_LbkDev.int_out_func(utr->status, utr->buff, utr->ep->wMaxPacketSize);
        goto err_out;
    }

    /* callback to prepare data for next interrupt out trasnfer */
    if(s_LbkDev.int_out_func)
        utr->data_len = (uint32_t)s_LbkDev.int_out_func(0, utr->buff, utr->ep->wMaxPacketSize);

    utr->xfer_len = 0;
    ret = usbh_int_xfer(utr);
    if(ret != 0)
    {
        printf("int_out_done - failed to re-submit interrupt-out request (%d)", ret);
        s_LbkDev.int_out_func(-1, utr->buff, 0);
        goto err_out;
    }
    return;

err_out:
    if(utr == s_LbkDev.utr_int_out[0])
    {
        free_utr(s_LbkDev.utr_int_out[0]);
        s_LbkDev.utr_int_out[0] = NULL;
    }
    else if(utr == s_LbkDev.utr_int_out[1])
    {
        free_utr(s_LbkDev.utr_int_out[1]);
        s_LbkDev.utr_int_out[1] = NULL;
    }
}

/*
 *  Start interrupt-in transfer on Vendor LBK device.
 */
int lbk_interrupt_out_start(INT_CB_FUNC *func)
{
    UTR_T     *utr;
    int       i, ret;

    if((s_LbkDev.udev == NULL) || (s_LbkDev.ep_int_out == NULL) || (func == NULL))
        return -1;

    for(i = 0; i < 2; i++)
    {
        utr = alloc_utr(s_LbkDev.udev);
        if(!utr)
            return USBH_ERR_MEMORY_OUT;

        utr->ep = s_LbkDev.ep_int_out;
        utr->buff = (uint8_t *)(uint32_t)s_LbkDev.buff_int_out[i];
        utr->xfer_len = 0;
        utr->func = int_out_done;
        s_LbkDev.int_out_func = func;
        s_LbkDev.utr_int_out[i] = utr;
        utr->data_len = (uint32_t)s_LbkDev.int_out_func(0, utr->buff, utr->ep->wMaxPacketSize);

        ret = usbh_int_xfer(utr);
        if(ret < 0)
        {
            //printf("Error - failed to submit interrupt-out transfer (%d)\n", ret);
            free_utr(utr);
            s_LbkDev.utr_int_out[i] = NULL;
            return ret;
        }
    }
    return 0;
}

void lbk_interrupt_out_stop(void)
{
    int   i;

    /* clear <int_in_func> to stop cascading transfers */
    s_LbkDev.int_out_func = NULL;
    delay_us(32000);

    for(i = 0; i < 2; i++)
    {
        if(s_LbkDev.utr_int_out[i] != NULL)
        {
            usbh_quit_utr(s_LbkDev.utr_int_out[i]);    /* force to stop the transfer   */
            delay_us(32000);
            free_utr(s_LbkDev.utr_int_out[i]);
            s_LbkDev.utr_int_out[i] = NULL;
        }
    }
}

static void iso_in_done(UTR_T *utr)
{
    int         i, ret;

    //printf("SF=%d, 0x%x\n", utr->iso_sf, (int)utr);
    if(!s_LbkDev.iso_in_func)
        return;

    utr->bIsoNewSched = 0;

    for(i = 0; i < IF_PER_UTR; i++)
    {
        if(utr->iso_status[i] == 0)
        {
            if(s_LbkDev.iso_in_func && (utr->iso_xlen[i] > 0))
                s_LbkDev.iso_in_func(utr->buff, (int)utr->xfer_len);
        }
        else
        {
            if((utr->iso_status[i] == USBH_ERR_NOT_ACCESS0) || (utr->iso_status[i] == USBH_ERR_NOT_ACCESS1))
                utr->bIsoNewSched = 1;
            else
            {
                // printf("Iso %d err - %d\n", i, utr->iso_status[i]);
            }
        }
        utr->iso_xlen[i] = utr->ep->wMaxPacketSize;
    }

    /* schedule the following isochronous transfers */
    ret = usbh_iso_xfer(utr);
    if(ret < 0)
        printf("isochronous-in re-submit failed!\n");
}

/*
 *  Start isochronous-in transfer on Vendor LBK device.
 */
int lbk_isochronous_in_start(ISO_CB_FUNC *func)
{
    UTR_T        *utr;
    EP_INFO_T    *ep;
    uint8_t      *buff;
    int          i, j, ret;

    s_LbkDev.iso_in_func = func;
    ep = s_LbkDev.ep_iso_in;

    if((ep == NULL) || (func == NULL))
        return -1;

    /*------------------------------------------------------------------------------------*/
    /*  Allocate isochronous in buffer                                                    */
    /*------------------------------------------------------------------------------------*/
    for(i = 0; i < ISO_UTR_NUM; i++)        /* allocate UTRs                              */
    {
        s_LbkDev.utr_iso_in[i] = alloc_utr(s_LbkDev.udev);      /* allocate UTR         */
        if(s_LbkDev.utr_iso_in[i] == NULL)
        {
            printf("Memory not enough! Please increase the UTR number.\n");
            ret = USBH_ERR_MEMORY_OUT;      /* memory allocate failed                     */
            goto err_out;                   /* abort                                      */
        }
    }

    buff = (uint8_t *)usbh_alloc_mem(ep->wMaxPacketSize * IF_PER_UTR * ISO_UTR_NUM);
    if(buff == NULL)
    {
        printf("Memory not enough! Please increase the heap size.\n");
        ret = USBH_ERR_MEMORY_OUT;          /* memory allocate failed                     */
        goto err_out;                       /* abort                                      */
    }

    for(i = 0; i < ISO_UTR_NUM; i++)        /* dispatch buffers                           */
    {
        /* divide buffer equally                      */
        utr = s_LbkDev.utr_iso_in[i];
        utr->buff = buff + (ep->wMaxPacketSize * IF_PER_UTR * i);
        utr->data_len = ep->wMaxPacketSize * IF_PER_UTR;
        for(j = 0; j < IF_PER_UTR; j++)
        {
            utr->iso_xlen[j] = ep->wMaxPacketSize;
            utr->iso_buff[j] = utr->buff + (ep->wMaxPacketSize * j);
        }
    }

    /*------------------------------------------------------------------------------------*/
    /*  Start UTRs                                                                        */
    /*------------------------------------------------------------------------------------*/

    s_LbkDev.utr_iso_in[0]->bIsoNewSched = 1;

    for(i = 0; i < ISO_UTR_NUM; i++)
    {
        utr = s_LbkDev.utr_iso_in[i];
        utr->ep = ep;
        utr->func = iso_in_done;
        ret = usbh_iso_xfer(utr);
        if(ret < 0)
        {
            printf("Error - failed to start UTR %d isochronous-in transfer (%d)", i, ret);
            goto err_out;
        }
    }
    return 0;

err_out:

    for(i = 0; i < ISO_UTR_NUM; i++)            /* quit all UTRs                              */
    {
        if(s_LbkDev.utr_iso_in[i])
            usbh_quit_utr(s_LbkDev.utr_iso_in[i]);
    }

    /* free USB transfer buffer                   */
    if((s_LbkDev.utr_iso_in[0] != NULL) &&
            (s_LbkDev.utr_iso_in[0]->buff != NULL))
        usbh_free_mem(s_LbkDev.utr_iso_in[0]->buff, (int)s_LbkDev.utr_iso_in[0]->data_len * ISO_UTR_NUM);

    for(i = 0; i < ISO_UTR_NUM; i++)            /* free all UTRs                              */
    {
        if(s_LbkDev.utr_iso_in[i])
            free_utr(s_LbkDev.utr_iso_in[i]);
        s_LbkDev.utr_iso_in[i] = NULL;
    }
    return ret;
}

