OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBH_VENDOR_LBK/lbk_driver.c
void lbk_isochronous_in_stop(void)
{
    int          i;

    /* clear <iso_in_func> to stop cascading transfers */
    s_LbkDev.iso_in_func = NULL;

    for(i = 0; i < ISO_UTR_NUM; i++)        /* stop all UTRs                              */
    {
        if(s_LbkDev.utr_iso_in[i])
            usbh_quit_utr(s_LbkDev.utr_iso_in[i]);
    }

    if((s_LbkDev.utr_iso_in[0] != NULL) &&
            (s_LbkDev.utr_iso_in[0]->buff != NULL))       /* free audio buffer                */
        usbh_free_mem(s_LbkDev.utr_iso_in[0]->buff, (int)s_LbkDev.utr_iso_in[0]->data_len * ISO_UTR_NUM);

    for(i = 0; i < ISO_UTR_NUM; i++)        /* free all UTRs                              */
    {
        if(s_LbkDev.utr_iso_in[i])
            free_utr(s_LbkDev.utr_iso_in[i]);
        s_LbkDev.utr_iso_in[i] = NULL;
    }
}

static void iso_out_done(UTR_T *utr)
{
    int   i, ret;
    //printf("SF=%d, 0x%x\n", utr->iso_sf, (int)utr);

    if(!s_LbkDev.iso_out_func)
        return;

    utr->bIsoNewSched = 0;

    for(i = 0; i < IF_PER_UTR; i++)
    {
        if(utr->iso_status[i] != 0)
        {
            // printf("Iso %d err - %d\n", i, utr->iso_status[i]);
            if((utr->iso_status[i] == USBH_ERR_NOT_ACCESS0) || (utr->iso_status[i] == USBH_ERR_NOT_ACCESS1))
                utr->bIsoNewSched = 1;
        }
        if(s_LbkDev.iso_out_func)
            utr->iso_xlen[i] = (uint16_t)s_LbkDev.iso_out_func(utr->iso_buff[i], utr->ep->wMaxPacketSize);
    }

    /* schedule the following isochronous transfers */
    ret = usbh_iso_xfer(utr);
    if(ret < 0)
        printf("isochronous-out re-submit failed!\n");
}

/*
 *  Start isochronous-out transfer on Vendor LBK device.
 */
int lbk_isochronous_out_start(ISO_CB_FUNC *func)
{
    EP_INFO_T    *ep;
    UTR_T        *utr;
    uint8_t      *buff;
    int          i, j, ret;

    s_LbkDev.iso_out_func = func;
    ep = s_LbkDev.ep_iso_out;

    if((ep == NULL) || (func == NULL))
        return -1;

    /*------------------------------------------------------------------------------------*/
    /*  Allocate isochronous in buffer                                                    */
    /*------------------------------------------------------------------------------------*/
    for(i = 0; i < ISO_UTR_NUM; i++)        /* allocate UTRs                              */
    {
        s_LbkDev.utr_iso_out[i] = alloc_utr(s_LbkDev.udev);     /* allocate UTR         */
        if(s_LbkDev.utr_iso_out[i] == NULL)
        {
            printf("Memory not enough! Please increase the UTR number.\n");
            ret = USBH_ERR_MEMORY_OUT;      /* memory allocate failed                     */
            goto err_out;                   /* abort                                      */
        }
    }

    buff = (uint8_t *)usbh_alloc_mem(ep->wMaxPacketSize * IF_PER_UTR * ISO_UTR_NUM);
    if(buff == NULL)
    {
        printf("Memory not enough! Please increase the heap size.\n");
        ret = USBH_ERR_MEMORY_OUT;          /* memory allocate failed                     */
        goto err_out;                       /* abort                                      */
    }

    for(i = 0; i < ISO_UTR_NUM; i++)            /* dispatch buffers                           */
    {
        /* divide buffer equally                      */
        s_LbkDev.utr_iso_out[i]->buff = buff + (ep->wMaxPacketSize * IF_PER_UTR * i);
        s_LbkDev.utr_iso_out[i]->data_len = ep->wMaxPacketSize * IF_PER_UTR;
    }

    /*------------------------------------------------------------------------------------*/
    /*  Start UTRs                                                                        */
    /*------------------------------------------------------------------------------------*/

    s_LbkDev.utr_iso_out[0]->bIsoNewSched = 1;

    for(i = 0; i < ISO_UTR_NUM; i++)
    {
        utr = s_LbkDev.utr_iso_out[i];
        utr->ep = ep;
        utr->func = iso_out_done;

        for(j = 0; j < IF_PER_UTR; j++)     /* get audio out data from user               */
        {
            utr->iso_buff[j] = utr->buff + (ep->wMaxPacketSize * j);
            utr->iso_xlen[j] = (uint16_t)s_LbkDev.iso_out_func(utr->iso_buff[j], ep->wMaxPacketSize);
        }

        ret = usbh_iso_xfer(utr);
        if(ret < 0)
        {
            printf("Error - failed to start UTR %d isochronous-in transfer (%d)", i, ret);
            goto err_out;
        }
    }
    return 0;

err_out:

    for(i = 0; i < ISO_UTR_NUM; i++)            /* quit all UTRs                              */
    {
        if(s_LbkDev.utr_iso_out[i])
            usbh_quit_utr(s_LbkDev.utr_iso_out[i]);
    }

    if((s_LbkDev.utr_iso_out[0] != NULL) &&            /* free USB transfer buffer                   */
            (s_LbkDev.utr_iso_out[0]->buff != NULL))
        usbh_free_mem(s_LbkDev.utr_iso_out[0]->buff, (int)s_LbkDev.utr_iso_out[0]->data_len * ISO_UTR_NUM);

    for(i = 0; i < ISO_UTR_NUM; i++)            /* free all UTRs                              */
    {
        if(s_LbkDev.utr_iso_out[i])
            free_utr(s_LbkDev.utr_iso_out[i]);
        s_LbkDev.utr_iso_out[i] = NULL;
    }
    return ret;
}

void lbk_isochronous_out_stop(void)
{
    int          i;

    /* clear <iso_out_func> to stop cascading transfers */
    s_LbkDev.iso_out_func = NULL;

    for(i = 0; i < ISO_UTR_NUM; i++)            /* stop all UTRs                              */
    {
        if(s_LbkDev.utr_iso_out[i])
            usbh_quit_utr(s_LbkDev.utr_iso_out[i]);
    }

    if((s_LbkDev.utr_iso_out[0] != NULL) &&
            (s_LbkDev.utr_iso_out[0]->buff != NULL))       /* free transfer buffer           */
        usbh_free_mem(s_LbkDev.utr_iso_out[0]->buff, (int)s_LbkDev.utr_iso_out[0]->data_len * ISO_UTR_NUM);

    for(i = 0; i < ISO_UTR_NUM; i++)            /* free all UTRs                              */
    {
        if(s_LbkDev.utr_iso_out[i])
            free_utr(s_LbkDev.utr_iso_out[i]);
        s_LbkDev.utr_iso_out[i] = NULL;
    }
}

static int lbk_probe(IFACE_T *iface)
{
    UDEV_T       *udev = iface->udev;
    ALT_IFACE_T  *aif = iface->aif;
    DESC_IF_T    *ifd;              /* interface descriptor */
    int          i;

