OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBH_VENDOR_LBK/lbk_driver.c
    ifd = aif->ifd;

    if((udev->descriptor.idVendor != LBK_VENDOR_ID) || (udev->descriptor.idProduct != LBK_DEVICE_ID))
    {
        printf("Not Vendor LBK device. Ignore this device.\n");
        return USBH_ERR_NOT_MATCHED;
    }

    /* Is this interface HID class? */
    if((ifd->bInterfaceClass != 0xFF) || (ifd->bInterfaceSubClass != 0xFF))
    {
        printf("Not Vendor LBK interface. Ignore this interface.\n");
        return USBH_ERR_NOT_MATCHED;
    }

    if(s_LbkDev.udev != NULL)
    {
        printf("A Vendor LBK device is connected, do not support multiple devices!\n");
        return USBH_ERR_NOT_MATCHED;
    }

    printf("lbk_probe - device found (vid=0x%x, pid=0x%x), interface %d.\n",
           udev->descriptor.idVendor, udev->descriptor.idProduct, ifd->bInterfaceNumber);

    /*
     *  Find all endpoints of LBK device
     */
    for(i = 0; i < aif->ifd->bNumEndpoints; i++)
    {
        if((aif->ep[i].bmAttributes & EP_ATTR_TT_MASK) == EP_ATTR_TT_BULK)
        {
            printf("Bulk-%s endpoint: 0x%x\n", ((aif->ep[i].bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_IN) ? "in" : "out", aif->ep[i].bEndpointAddress);
            if((aif->ep[i].bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_IN)
                s_LbkDev.ep_bulk_in = &aif->ep[i];
            else
                s_LbkDev.ep_bulk_out = &aif->ep[i];
        }
        else if((aif->ep[i].bmAttributes & EP_ATTR_TT_MASK) == EP_ATTR_TT_INT)
        {
            printf("Interrupt-%s endpoint: 0x%x\n", ((aif->ep[i].bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_IN) ? "in" : "out", aif->ep[i].bEndpointAddress);
            if((aif->ep[i].bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_IN)
                s_LbkDev.ep_int_in = &aif->ep[i];
            else
                s_LbkDev.ep_int_out = &aif->ep[i];
        }
        else if((aif->ep[i].bmAttributes & EP_ATTR_TT_MASK) == EP_ATTR_TT_ISO)
        {
            printf("Isochronous-%s endpoint: 0x%x\n", ((aif->ep[i].bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_IN) ? "in" : "out", aif->ep[i].bEndpointAddress);
            if((aif->ep[i].bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_IN)
                s_LbkDev.ep_iso_in = &aif->ep[i];
            else
                s_LbkDev.ep_iso_out = &aif->ep[i];
        }
    }
    s_LbkDev.udev = udev;
    s_LbkDev.iface = iface;
    return 0;
}

static void  lbk_disconnect(IFACE_T *iface)
{
    int   i;

    lbk_interrupt_in_stop();
    lbk_interrupt_out_stop();
    lbk_isochronous_in_stop();
    lbk_isochronous_out_stop();

    for(i = 0; i < iface->aif->ifd->bNumEndpoints; i++)
    {
        iface->udev->hc_driver->quit_xfer(NULL, &(iface->aif->ep[i]));
    }
    memset((void *)(uint32_t)&s_LbkDev, 0, sizeof(s_LbkDev));
}

static UDEV_DRV_T  s_LbkDriver =
{
    lbk_probe,
    lbk_disconnect,
    NULL,                       /* suspend */
    NULL,                       /* resume */
};

/// @endcond /* HIDDEN_SYMBOLS */


/**
  * @brief    Initialize USB Host Vendor LBK driver.
  * @return   None
  */
void usbh_lbk_init(void)
{
    memset((void *)(uint32_t)&s_LbkDev, 0, sizeof(s_LbkDev));
    usbh_register_driver(&s_LbkDriver);
}

/**
  * @brief    Is the Vendor LBK device currently connected?
  * @return   1: yes
  *           0: no
  */
int lbk_device_is_connected(void)
{
    usbh_pooling_hubs();

    if(s_LbkDev.udev != NULL)
        return 1;
    else
        return 0;
}

/**
  * @brief    Is the Vendor LBK device in high speed mode?
  * @return   1: yes
  *           0: no
  *          -1: Not connected
  */
int lbk_device_is_high_speed(void)
{
    usbh_pooling_hubs();

    if(s_LbkDev.udev == NULL)
        return -1;

    if(s_LbkDev.udev->speed == SPEED_HIGH)
        return 1;
    else
        return 0;
}

int lbk_device_reset(void)
{
    if(s_LbkDev.udev != NULL)
        return usbh_reset_device(s_LbkDev.udev);
    return 0;
}

/*** (C) COPYRIGHT 2019 Nuvoton Technology Corp. ***/

